# Data Testing

In [1]:
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split

In [2]:
dataset_iris = pd.read_csv('https://raw.githubusercontent.com/mwaskom/seaborn-data/master/iris.csv')
dataset_iris.head(5)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [3]:
#panjang dataset
print(f'panjang dataset{len(dataset_iris)}baris')

panjang dataset150baris

In [5]:
#cara manual
data_train =dataset_iris[['sepal_length', 'sepal_width','petal_length','petal_width']][:100]
label_train =dataset_iris['species'][:100]

data_test=dataset_iris[['sepal_length', 'sepal_width','petal_length','petal_width']][-50:]
label_test=dataset_iris['species'][-50:]

In [9]:
print(f'panjang data training {len(data_train)}',
     f'panjang label training {len(label_train)}',
     f'panjang data testing {len(data_test)}',
     f'panjang label testing {len(label_test)}',
     sep='\n')

panjang data training 100
panjang label training 100
panjang data testing 50
panjang label testing 50

#otomatis

data = dataset_iris[['sepal_length', 'sepal_width','petal_length','petal_width']]
label = dataset_iris['species']

data_train, data_test, label_train, label_test = train_test_split(data, label, test_size=.2)

In [8]:
print(f'panjang data training {len(data_train)}',
     f'panjang label training {len(label_train)}',
     f'panjang data testing {len(data_test)}',
     f'panjang label testing {len(label_test)}',
     sep='\n')

panjang data training 100
panjang label training 100
panjang data testing 50
panjang label testing 50

# Data Transformasi

In [11]:
from sklearn.preprocessing import StandardScaler #standarisasi
from sklearn.preprocessing import MinMaxScaler #normalisasi
#visualisasi uji
import matplotlib.pyplot as plt
import seaborn as sns

In [29]:
dataset_transformasi = dataset_iris.copy()

In [25]:
# normalisasi

#bikin alatnya
scaler = MinMaxScaler()

#gunakan alat
normalize_dataset = scaler.fit_transform(dataset_transformasi[['sepal_length', 'sepal_width','petal_length','petal_width']])

normalize_dataset = pd.DataFrame(normalize_dataset)
normalize_dataset.rename(columns={0:'sepal_length',1: 'sepal_width',3:'petal_length',4:'petal_width'},
                        inplace=True)
normalize_dataset.head(5)

   sepal_length  sepal_width         2  petal_length
0      0.222222     0.625000  0.067797      0.041667
1      0.166667     0.416667  0.067797      0.041667
2      0.111111     0.500000  0.050847      0.041667
3      0.083333     0.458333  0.084746      0.041667
4      0.194444     0.666667  0.067797      0.041667

In [30]:
#standarisasi

#bikin dataset
dataset_transformasi.drop('species', axis=1, inplace=True)

#bikin alat
standart_std = StandardScaler()

#standarisasikan
scaler_dataset = standart_std.fit_transform(dataset_transformasi)

# Data Cleaning

In [31]:
data_ns = pd.read_csv('https://raw.githubusercontent.com/rrizwan43/Data-Cleanig-with-SQL/main/Cleaned_nashville_housing_dataset_.csv')
data_ns.head(5)

,UniqueID,ParcelID,LandUse,SalePrice,LegalReference,SoldAsVacant,OwnerName,Acreage,LandValue,BuildingValue,...,YearBuilt,Bedrooms,FullBath,HalfBath,SALEDATECONVERTED,PropertySplitAddress,PropertySplitCity,OwnerSplitAddress,OwnerSplitCity,OwnerSplitState
0,2045,007 00 0 125.00,SINGLE FAMILY,240000,20130412-0036474,No,"FRAZIER, CYRENTHA LYNETTE",2.3,50000.0,168200.0,...,1986.0,3.0,3.0,0.0,4/9/2013,1808 FOX CHASE DR,GOODLETTSVILLE,1808 FOX CHASE DR,GOODLETTSVILLE,TN
1,16918,007 00 0 130.00,SINGLE FAMILY,366000,20140619-0053768,No,"BONER, CHARLES & LESLIE",3.5,50000.0,264100.0,...,1998.0,3.0,3.0,2.0,6/10/2014,1832 FOX CHASE DR,GOODLETTSVILLE,1832 FOX CHASE DR,GOODLETTSVILLE,TN
2,54582,007 00 0 138.00,SINGLE FAMILY,435000,20160927-0101718,No,"WILSON, JAMES E. & JOANNE",2.9,50000.0,216200.0,...,1987.0,4.0,3.0,0.0,9/26/2016,1864 FOX CHASE DR,GOODLETTSVILLE,1864 FOX CHASE DR,GOODLETTSVILLE,TN
3,43070,007 00 0 143.00,SINGLE FAMILY,255000,20160129-0008913,No,"BAKER, JAY K. & SUSAN E.",2.6,50000.0,147300.0,...,1985.0,3.0,3.0,0.0,1/29/2016,1853 FOX CHASE DR,GOODLETTSVILLE,1853 FOX CHASE DR,GOODLETTSVILLE,TN
4,22714,007 00 0 149.00,SINGLE FAMILY,278000,20141015-0095255,No,"POST, CHRISTOPHER M. & SAMANTHA C.",2.0,50000.0,152300.0,...,1984.0,4.0,3.0,0.0,10/10/2014,1829 FOX CHASE DR,GOODLETTSVILLE,1829 FOX CHASE DR,GOODLETTSVILLE,TN

In [32]:
data_ns.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 56373 entries, 0 to 56372
Data columns (total 21 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   UniqueID              56373 non-null  int64
 1   ParcelID              56373 non-null  object
 2   LandUse               56373 non-null  object
 3   SalePrice             56373 non-null  int64
 4   LegalReference        56373 non-null  object
 5   SoldAsVacant          56373 non-null  object
 6   OwnerName             25215 non-null  object
 7   Acreage               25969 non-null  float64
 8   LandValue             25969 non-null  float64
 9   BuildingValue         25969 non-null  float64
 10  TotalValue            25969 non-null  float64
 11  YearBuilt             24118 non-null  float64
 12  Bedrooms              24112 non-null  float64
 13  FullBath              24230 non-null  float64
 14  HalfBath              24099 non-null  float64
 15  SALEDATECONVERTED     56373 non-null  object
 16  PropertySplitAddress  56373 non-null  object
 17  PropertySplitCity     56373 non-null  object
 18  OwnerSplitAddress     25969 non-null  object
 19  OwnerSplitCity        25969 non-null  object
 20  OwnerSplitState       25969 non-null  object
dtypes: float64(8), int64(2), object(11)
memory usage: 9.0+ MB

In [46]:
data_ns.isna().sum()

UniqueID                    0
ParcelID                    0
LandUse                     0
SalePrice                   0
LegalReference              0
SoldAsVacant                0
OwnerName               31158
Acreage                 30404
LandValue               30404
BuildingValue           30404
TotalValue              30404
YearBuilt               32255
Bedrooms                32261
FullBath                32143
HalfBath                32274
SALEDATECONVERTED           0
PropertySplitAddress        0
PropertySplitCity           0
OwnerSplitAddress       30404
OwnerSplitCity          30404
OwnerSplitState         30404
dtype: int64

In [48]:
dataset_ns = data_ns.copy()

In [49]:
from sklearn.impute import SimpleImputer

In [50]:
# null value

# bikin alat
imputer_mean = SimpleImputer(strategy='mean')#float
imputer_median = SimpleImputer(strategy='median')
imputer_modus = SimpleImputer(strategy='most_frequent')

In [51]:
#modus
dataset_ns['OwnerName'] = imputer_modus.fit_transform(dataset_ns[['OwnerName']])

dataset_ns.isna().sum()

UniqueID                    0
ParcelID                    0
LandUse                     0
SalePrice                   0
LegalReference              0
SoldAsVacant                0
OwnerName                   0
Acreage                 30404
LandValue               30404
BuildingValue           30404
TotalValue              30404
YearBuilt               32255
Bedrooms                32261
FullBath                32143
HalfBath                32274
SALEDATECONVERTED           0
PropertySplitAddress        0
PropertySplitCity           0
OwnerSplitAddress       30404
OwnerSplitCity          30404
OwnerSplitState         30404
dtype: int64

In [52]:
# #mean
dataset_ns['Acreage'] = imputer_mean.fit_transform(dataset_ns[['Acreage']])
dataset_ns['LandValue'] = imputer_mean.fit_transform(dataset_ns[['LandValue']])
dataset_ns['BuildingValue'] = imputer_mean.fit_transform(dataset_ns[['BuildingValue']])
dataset_ns['TotalValue'] = imputer_mean.fit_transform(dataset_ns[['TotalValue']])
dataset_ns['YearBuilt'] = imputer_mean.fit_transform(dataset_ns[['YearBuilt']])
dataset_ns['Bedrooms'] = imputer_mean.fit_transform(dataset_ns[['Bedrooms']])
dataset_ns['FullBath'] = imputer_mean.fit_transform(dataset_ns[['FullBath']])
dataset_ns['HalfBath'] = imputer_mean.fit_transform(dataset_ns[['HalfBath']])

dataset_ns.isna().sum()

UniqueID                    0
ParcelID                    0
LandUse                     0
SalePrice                   0
LegalReference              0
SoldAsVacant                0
OwnerName                   0
Acreage                     0
LandValue                   0
BuildingValue               0
TotalValue                  0
YearBuilt                   0
Bedrooms                    0
FullBath                    0
HalfBath                    0
SALEDATECONVERTED           0
PropertySplitAddress        0
PropertySplitCity           0
OwnerSplitAddress       30404
OwnerSplitCity          30404
OwnerSplitState         30404
dtype: int64

In [53]:
dataset_ns.dropna(inplace=True)

dataset_ns.isna().sum()

UniqueID                0
ParcelID                0
LandUse                 0
SalePrice               0
LegalReference          0
SoldAsVacant            0
OwnerName               0
Acreage                 0
LandValue               0
BuildingValue           0
TotalValue              0
YearBuilt               0
Bedrooms                0
FullBath                0
HalfBath                0
SALEDATECONVERTED       0
PropertySplitAddress    0
PropertySplitCity       0
OwnerSplitAddress       0
OwnerSplitCity          0
OwnerSplitState         0
dtype: int64

In [54]:
len(dataset_ns)

25969

In [55]:
#cek duplikat
dataset_duplicate = data_ns.copy()

dataset_duplicate.duplicated().sum()

0

In [56]:
dataset_duplicate = dataset_iris.copy()

dataset_duplicate.duplicated().sum()

1

In [57]:
dataset_duplicate.drop_duplicates(inplace=True)

dataset_duplicate.duplicated().sum()

0

In [62]:
dataset_iris.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

In [64]:
dataset_iris['sepal_length'].head(5)

0    5.1
1    4.9
2    4.7
3    4.6
4    5.0
Name: sepal_length, dtype: float64

In [67]:
dataset_iris['sepal_length'].astype('int32').dtypes

dtype('int32')

In [69]:
dataset_iris['sepal_length'].astype('int32').head(5)

0    5
1    4
2    4
3    4
4    5
Name: sepal_length, dtype: int32

# Encoding

In [70]:
from sklearn.preprocessing import OrdinalEncoder
from sklearn.preprocessing import OneHotEncoder

In [93]:
dataset_ordinal = dataset_iris.copy()
dataset_one_hot = dataset_iris.copy()

In [74]:
#ordinal encoding
dataset_ordinal.head(5)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [75]:
dataset_iris['species'].unique()

array(['setosa', 'versicolor', 'virginica'], dtype=object)

In [77]:
#bikin alat
encoder_ordinal =OrdinalEncoder()

#encoding kan
dataset_ordinal['species'] = encoder_ordinal.fit_transform(dataset_ordinal[['species']]).astype('int64')

#lihat
dataset_ordinal.head(5)

   sepal_length  sepal_width  petal_length  petal_width  species
0           5.1          3.5           1.4          0.2        0
1           4.9          3.0           1.4          0.2        0
2           4.7          3.2           1.3          0.2        0
3           4.6          3.1           1.5          0.2        0
4           5.0          3.6           1.4          0.2        0

In [78]:
dataset_ordinal['species'].unique()

array([0, 1, 2], dtype=int64)

In [79]:
temp_dataset = pd.get_dummies(dataset_one_hot[['species']]) #one hot encoding

#bikin dataframe
temp_dataset = pd.DataFrame(temp_dataset)

temp_dataset.head(5)

   species_setosa  species_versicolor  species_virginica
0               1                   0                  0
1               1                   0                  0
2               1                   0                  0
3               1                   0                  0
4               1                   0                  0

In [94]:
temp_dataset = pd.get_dummies(dataset_one_hot[['species']]) #one hot encoding

temp_dataset = pd.DataFrame(temp_dataset)

dataset_one_hot.drop('species', axis=1, inplace=True)

dataset_one_hot = dataset_one_hot.join(temp_dataset)
dataset_one_hot.head(5)

,sepal_length,sepal_width,petal_length,petal_width,species_setosa,species_versicolor,species_virginica
0,5.1,3.5,1.4,0.2,1,0,0
1,4.9,3.0,1.4,0.2,1,0,0
2,4.7,3.2,1.3,0.2,1,0,0
3,4.6,3.1,1.5,0.2,1,0,0
4,5.0,3.6,1.4,0.2,1,0,0